{"pageProps":{"data":{"article":{"title":"Reflections and connections on the road to October 2024","date":"2024-10-14"},"children":"<p>The last quarter of the year is always a busy and exciting time, full of events and opportunities to meet. For me, it means the chance to travel, share knowledge, and connect with incredible people who are part of our vibrant Cloud Native community.</p>\n<p>As a Developer Advocate at Mia-Platform and CNCF Ambassador, I have the privilege of participating in events where I can not only share my ideas and discuss innovation but also meet professionals with diverse backgrounds and expertise. This continuous exchange of ideas is one of the most rewarding aspects of my job: each event is an opportunity to learn, network, and build lasting relationships. Reconnecting with old friends and meeting new talents in the community is what makes these gatherings special.</p>\n<h2>The Growing Cloud Native Community</h2>\n<p>What I appreciate the most is the energy and enthusiasm that fills these events. The Cloud Native community is continuously growing, becoming more vibrant and stimulating. Actively participating allows me not only to contribute my expertise but also to receive valuable feedback, learn from others, and discover new perspectives. This spirit of sharing drives technological progress and strengthens the bond between those working in this field.</p>\n<h2>My Event Schedule Until October</h2>\n<p>I’m excited to share that the next few months are packed with events where I’ll be speaking, and I truly hope to meet you there. If you’ll be attending any of these, don’t hesitate to stop by and chat with me about Platform Engineering, Cloud Native, sustainability, or any other tech-related topic. Here’s my schedule until October:</p>\n<ul>\n<li>\n<p><strong>KCD Porto</strong> - September 27-28, 2024\n<em>Talk: \"Sustainability in Cloud Native: strategies and tools for a green future\"</em>\nI will discuss sustainability in the Cloud Native context, focusing on the strategies and tools we can adopt to reduce the environmental impact of technology.\n<a href=\"https://community.cncf.io/events/details/cncf-kcd-porto-presents-kcd-porto-2024/\">Link</a></p>\n</li>\n<li>\n<p><strong>Cloud Native London</strong> - October 2, 2024\n<em>Talk: \"How to build a Conversational DevX interface using RAG\"</em>\nIn this talk, I will explore how we can improve Developer Experience through artificial intelligence by building conversational interfaces using Retrieval-Augmented Generation (RAG).\n<a href=\"https://www.meetup.com/cloud-native-london/events/300767226\">Link</a></p>\n</li>\n<li>\n<p><strong>Container Day Bologna</strong> - October 10, 2024\n<em>Talk with Sara Trappetti: \"Navigating the CNCF Landscape: One Piece at a Time\"</em>\nTogether with Sara Trappetti, we will guide the audience through the complex CNCF landscape, helping participants navigate and discover the most relevant technologies.\n<a href=\"https://2024.containerday.it/\">Link</a></p>\n</li>\n<li>\n<p><strong>BetterSoftware Bologna</strong> - October 11, 2024\n<em>Talk: \"Sustainability and Cloud Native: strategies and tools for a green future\"</em>\nAnother talk focused on sustainability, with a specific emphasis on how Cloud Native can contribute to building a greener technological future.\n<a href=\"https://2024.bettersoftware.it/\">Link</a></p>\n</li>\n<li>\n<p><strong>Cloud Native Bergen (Norway)</strong> - October 30, 2024\n<em>Talk: \"Enhanced Developer Experience in a Cloud Native world\"</em>\nI will focus on how to enhance Developer Experience in an increasingly Cloud Native world, exploring technologies and practices that can make developers’ lives easier and more efficient.\n<a href=\"https://2024.cloudnativebergen.dev/\">Link</a></p>\n</li>\n</ul>\n<h2>An Invitation to Conversation</h2>\n<p>Attending these events isn’t just an opportunity to speak, but also to listen. I truly enjoy exchanging ideas, discussing new trends, and exploring how we can continue to innovate. I look forward to meeting new members of the community, hearing their stories, and discovering what drives their passion for technology.</p>\n<p>If you see me at one of these events, don’t hesitate to stop by! I’d love to chat about any topic that interests you: Platform Engineering, Cloud Native, tech innovation, or simply how we can build a better and more sustainable future together.</p>\n<p>See you soon!</p>\n","pageTitle":"Reflections and connections on the road to October 2024 - by Michel Murabito","pageDescription":"Reflections and connections on the road to October 2024 - by Michel Murabito","pageLink":"https://michelmurabito.com/articles/reflections-and-connections-october-2024","pageImage":"https://michelmurabito.com/michel_murabito_personal_website.png"},"schema":{"@context":"https://schema.org","@type":"BlogPosting","headline":"Reflections and connections on the road to October 2024","datePublished":"2024-10-14T00:00:00Z","dateModified":"2024-10-14T00:00:00Z","author":[{"@type":"Person","name":"Michel Murabito","url":"https://michelmurabito.com/about-me"}]}},"__N_SSG":true}