{"pageProps":{"children":"<b>Compose GenAI Apps: May the Force Be with Your Data and Models</b>\n        <br />A very short time ago, in a nearby galaxy (practically here and now), the force that pervades the universe encountered and connected composable architectures with Retrieval-Augmented Generation (RAG). Their synergy promises to revolutionize the development of Gen-AI applications, transforming months of work into just hours. In this talk, we will explore how modern ML/AI technologies, applied to real-world scenarios, can benefit from a composable approach to quickly address complex needs with contextualized and updated data.\n\nWe will discuss the challenges related to the implementation of these scalable solutions and the crucial role of Platform Engineering in reducing complexity and accelerating innovation. We will explore how the power of advanced architectures and platform engineering strategies can radically transform the landscape of “intelligent application” development.\n        <br />\n        <br />https://www.youtube.com/watch?v=sUv-suECYJ4\n        <br /><br /><br />Organized by GrUSP - https://www.grusp.org/","article":{"title":"MLOps @localhost 2024","date":"2024-05-21T09:00:00Z"},"data":{"schema":{"@context":"https://schema.org","@type":"Person","name":"Michel Murabito","image":"https://michelmurabito.com/assets/img/michel-murabito/profile_1.jpeg","jobTitle":"Developer Advocate","worksFor":{"@type":"Organization","name":"Mia-Platform","url":"https://www.mia-platform.eu"},"url":"https://www.michelmurabito.com","description":"I am a Developer Advocate at Mia-Platform and a proud member of the CNCF TAG Environmental Sustainability. I am passionate about platform engineering, cloud native technologies, and sustainability. This page showcases the projects, groups, and activities I love to work on.","knowsAbout":["Platform Engineering","Cloud-Native","Developer Experience","Cloud Sustainability","Open Source","Community Building"],"memberOf":[{"@type":"Organization","name":"GDG Italia"},{"@type":"Organization","name":"Cloud Native Milano"}]},"pageTitle":"MLOps @localhost 2024 - Michel Murabito","pageDescription":"Michel Murabito talk's: Compose GenAI Apps: May the Force Be with Your Data and Models","pageLink":"/articles/2024-05-mlops-localhost","pageImage":"https://michelmurabito.com/michel_murabito_personal_website.png"}},"__N_SSG":true}