{"pageProps":{"data":{"article":{"title":"KCD Italy 2024: an event from the community to the community","date":"2024-06-27"},"children":"<p>I am thrilled to share my experience as <a href=\"https://community.cncf.io/kcd-italy/\">one of the organizers</a> of the Kubernetes Community Day Italy (KCD Italy). This event, supported by the CNCF (Cloud-Native Computing Foundation) and organized by the Italian Kubernetes community, was a remarkable moment of connection, learning, and inspiration.</p>\n<p>The true heart of KCD Italy is the community. Organizing such an event, by the community for the community, has been an incredibly rewarding experience. We saw around 300 participants come together to share knowledge, stories, and innovations in the Open Source and Cloud-Native technologies. The sense of belonging and the desire to contribute to collective growth were palpable in every corner of the Savoia Regency Hotel in Bologna on June 20, 2024.</p>\n<p>We had the privilege of listening to established experts, emerging figures, and enthusiasts from the Cloud-Native world. The talks ranged from ephemeral clusters as a service, to the challenges of building a cloud for AI, to adventures in security. Each presentation offered valuable insights and sparked vibrant discussions among the participants.</p>\n<p>One of the most beautiful aspects of KCD Italy was the networking. The sponsor areas and coffee breaks were ideal moments to forge new friendships, discuss projects, and exchange innovative ideas. The Kubernetes community is truly special: open, inclusive, and always ready to support each other.</p>\n<p>I would like to thank everyone who participated and made this event possible. The speakers, with their inspiring presentations, the sponsors who supported the event, and of course all the participants who, with their energy and passion, created a unique atmosphere. It was truly exciting to see so many people united by the same passion for Kubernetes and Cloud-Native technologies.</p>\n<p>Organizing an event of this magnitude requires commitment and dedication, but seeing the enthusiasm and interest of the participants was the greatest reward. We look forward to seeing how the community will grow and evolve in the coming year, and we are already excited for the 2025 edition.</p>\n<p>Thank you all from the bottom of my heart for making KCD Italy 2024 an unforgettable success. Keep sharing, learning, and growing together. See you next time!</p>\n<p>A special thanks to <a href=\"https://www.mia-platform.eu\">Mia-Platform</a> for giving me the opportunity to actively contribute to the realization of this event.</p>\n<p>For more details about the organizers and the event, visit <a href=\"https://kcd.pizza/\">this page</a>.\nIf you want to stay updated on all the latest news, you can also follow us on <a href=\"https://www.linkedin.com/company/kcditaly/\">LinkedIn</a> and <a href=\"https://x.com/kcditaly\">X (formerly Twitter)</a></p>\n","pageTitle":"KCD Italy 2024: an event from the community to the community - Michel Murabito","pageDescription":"KCD Italy 2024: an event from the community to the community - Michel Murabito","pageLink":"https://michelmurabito.com/articles/kcd-italy-2024","pageImage":"https://michelmurabito.com/michel_murabito_personal_website.png"},"schema":{"@context":"https://schema.org","@type":"BlogPosting","headline":"KCD Italy 2024: an event from the community to the community","datePublished":"2024-06-27T00:00:00Z","dateModified":"2024-06-27T00:00:00Z","author":[{"@type":"Person","name":"Michel Murabito","url":"https://michelmurabito.com/about-me"}]}},"__N_SSG":true}