{"pageProps":{"children":"<p>Hello everyone! I'm <strong>Michel Murabito</strong>, but everyone calls me <strong>Mich</strong> (pronounced <em>Mitch</em>), a fervent Developer Advocate at <strong>Mia-Platform</strong>, with my roots deeply embedded in the beautiful land of Sicily and my heart beating in the fast-paced rhythm of Milan.</p>\n<h2>Who I Am</h2>\n<p>Born in Turin in 1986 and raised under the sun of Sicily, I started writing code at the age of 12, driven by curiosity and a passion for technology that still fuels every day of my life. My professional career kicked off at 18 as a software developer, and since then, I've never stopped exploring new horizons in the vast world of IT.</p>\n<h2>What I Do</h2>\n<p>Today, I find myself in the role of Developer Advocate at <strong>Mia-Platform</strong>, where I have the opportunity to merge my passion for technology with that for communication, working closely with the developer community. My goal is to make developers' lives simpler and more productive, through sharing knowledge, experiences, and best practices.</p>\n<h2>My Passions</h2>\n<p>Beyond my professional commitment, I am deeply involved in promoting sustainability in IT, a theme I consider crucial for the future of our planet and our industry. I am also an active contributor to the open source community, a staunch supporter of continuous learning, and a passionate speaker at national and international tech events.</p>\n<h3>A Deeper Dive into My Interests</h3>\n<p>My enthusiasm doesn't stop there; I am particularly passionate about <strong>Cloud Native technologies, Platform Engineering, and enhancing the Developer Experience</strong>. These fields represent the cutting edge of creating scalable, resilient, and efficient software solutions. They are also about building communities and ecosystems where developers can thrive, innovate, and deliver outstanding value rapidly and reliably.</p>\n<h2>Why a Blog?</h2>\n<p>I've decided to start this blog to share my reflections, discoveries, and experiences on this journey through the world of technology. Here you'll find articles on platform engineering, sustainability, advocacy, and much more.</p>\n<p>I invite every reader to interact, share opinions, and experiences: I firmly believe in the value of community and constructive dialogue.</p>\n<p>Thank you for taking the time to read these lines. I'm excited about embarking on this path with you.</p>\n<p>Until next time!\nMich</p>\n","article":{"title":"Hello World (again) Its me, Mich!","date":"2024-04-07"},"data":{"schema":{"@context":"https://schema.org","@type":"Person","name":"Michel Murabito","image":"https://michelmurabito.com/assets/img/michel-murabito/profile_1.jpeg","jobTitle":"Developer Advocate","worksFor":{"@type":"Organization","name":"Mia-Platform","url":"https://www.mia-platform.eu"},"url":"https://www.michelmurabito.com","description":"I am a Developer Advocate at Mia-Platform and a proud member of the CNCF TAG Environmental Sustainability. I am passionate about platform engineering, cloud native technologies, and sustainability. This page showcases the projects, groups, and activities I love to work on.","knowsAbout":["Platform Engineering","Cloud-Native","Developer Experience","Cloud Sustainability","Open Source","Community Building"],"memberOf":[{"@type":"Organization","name":"GDG Italia"},{"@type":"Organization","name":"Cloud Native Milano"}]},"pageTitle":"Hello World (again) Its me, Mich! - Michel Murabito","pageDescription":"Hello everyone! I'm **Michel Murabito**, but everyone calls me **Mich** (pronounced *Mitch*), a fervent Developer Advocate at **Mia-Platform**, with my roots deeply embedded in the beautiful land of Sicily and my heart beating in the fast-paced rhythm of Milan.","pageLink":"/articles/hello-world-again","pageImage":"https://michelmurabito.com/michel_murabito_personal_website.png"}},"__N_SSG":true}